[1,0,0,[["cc.TextAsset",["_name","text"],1]],[[0,0,1,3]],[[0,"privacy_policy","Moge Combat (hereinafter referred to as the \"APP \"), a game provided by Zeeyogo(hereinafter referred to as \"We\"), is recommended that you read this privacy policy in its entirety to help you understand how to maintain your privacy. If you have any questions about this privacy policy, you can contact us through the contact information published on the platform. We attach importance to the protection of minors' personal information. If you are a minor, we suggest that you ask your guardian to read this Privacy Policy carefully and use our services or provide us with information with the consent of your guardian. This Privacy policy mainly helps you to understand in detail how we or the third parties we cooperate with collect, use, store, transmit, share and protect personal information from the following aspects: Help you understand the query, access, delete, correct, withdraw authorized personal information.\nHow to collect and use your Personal Information - How to use cookies or similar technology 23, How to share, transfer and disclose your Personal Information 4, How to store your Personal Information 5, How to protect your Personal Information 6, how to manage your Personal Information 7, Terms of Use for Minors 8, Privacy Policy revision and Notification 9, How to contact us\n(1) The information you provide to us on your own initiative when you accept or use the services provided by us, including D the personal information you provide when you register as our user; 2. Information uploaded, posted or provided by you in order to obtain our specific services or functions; 3. Information submitted by you when participating in our online and offline activities; 4. Information you provide to our customer service or other official channels. The information we obtain when you accept or use our services includes :0 Log information: When you obtain our services, we may automatically collect relevant information and store it as service log information. 2 Location information: When you obtain our services or accept specific functions in the services, we may collect the geographical location information of the devices you use.\n3. Other information: In order to provide better service to you and improve the quality of our service, we may need to collect your other relevant information with your consent\n(3) Your information provided or shared with us by others. 0 Information about you provided by other users when accessing our services or information that may be contained in relation to you. 2. Information shared with us by third party partners. Information generated, provided or shared by you when you obtain the services of third party partners. In this case, please read the user agreement or privacy policy of the third party partner service carefully. We will abide by this policy and the privacy policy of the third party partner at the same time, so as to achieve the purpose of \"minimizing utilization and maximizing protection\" of your user information\nIn order to provide you with better products or services, we have accessed third-party services (including but not limited to real-name authentication, data analysis, third-party payment, advertising, etc.) within the APP. When you use our products or services, In order to ensure your normal use of the APP and optimize user experience, we and the third-party platforms we cooperate with may collect part of device-related information and personal information (including device letters) by invoking device permissions during APP installation and use\nInformation, read and write external memory, location information).\n1) Device identification information (such as hardware model, operating system version, device setting, IMEI, necessary software list, etc.) In order to protect your use of our products or job titles in the next class, realize statistics and analysis of APP number and improve the security of device account, the platform of the first party we cooperate with will collect 0 and device name of your device with your consent. It is assumed that the MAC address M of the wood system at each meter penalty site shall eventually connect with the and information of this column access network and authorize our joint platform to obtain the above information. If you use OPPO, VIVO, Huawei, Xiaomi, Meizu and other mobile phones, our APP may be connected to the SDK required by the above-mentioned mobile phone Guangzhou-commercial combined transportation, and the unique identifying information of the mobile phone (such as IME) needs to be collected. Parameters such as your mobile phone model, system type, system version, and device screen size may be collected to implement product functions. For details, see the privacy policy or related statement of the SDK operator.\n2) Storage permission In order to ensure that you can fully use the functions of the APP and save the data of players, we and our cooperative platform will obtain the storage permission of your mobile device with your consent. Refusing to authorize us or the third-party platforms we cooperate with to obtain the storage permission of your mobile device may cause you to be unable to use our APP normally or be restricted in the process of using our APP. 3) Geographical location information In order to enrich APP experience and achieve content diversity, The third party platforms we work with will collect your location information with your consent. Refusal to provide geographical location information will only prevent you from using location-related functions, but it will not affect your normal use of other functions of our APP. You may also cancel the authorization of the third-party platforms we cooperate with to obtain your geographic location information at any time. 4) Real-name identity information is in accordance with the requirements of relevant laws, regulations and relevant authorities. None of our game users shall carry out real-name authentication to continue using our games. The first platform we cooperate with will require you to write down your real name identity information after obtaining your homonym. This information is sensitive. Refusing to provide your real name identity information may cause you to be unable to log in our game or be restricted in using our game. If you want to know the specific rules about the collection of personal information by third-party service providers, please refer to the privacy policy of the third-party payment service provider of your choice.\n5) Payment information You may obtain the tiger products related to our APP by payment, including games, game props, game equipment, etc. The above payment service is provided by a third party, which may collect your top-up record, consumption record and other transaction information. We will not obtain payment account number, password and other information related to your payment. After your successful payment, we will only obtain your completed payment information from the third-party payment service provider, and then provide you with the corresponding virtual products. If you want to know the specific rules about the collection of personal information by third-party service providers, please refer to the privacy policy of the third-party payment service provider of your choice. 6) The permissions and corresponding uses of third-party platform SDK are as follows:\n6) Third-party SDK: Alliance + statistics\nPurpose :App data analysis\nInformation collected :1 Device identification information (such as hardware model, operating system version, device Settings, IME1, MAC address, AndroidID, list of necessary software, etc.)\n2. Obtain network information status and access network connections. GPRS traffic may be generated\nScope of application: All channel package Privacy Note:\n2 Third-party SDK: Qihoo 360 hardening protection plug-in Usage: code hardening confusion, prevent crack leakage Collected information :1 Device identification information (such as hardware model, operating system version, device Settings, IMEL, MAC address, AndroidiD, necessary software list, etc.)\n2. Obtain network information status and access network connections. GPRS traffic may be generated\nScope of application: All channel package Privacy Note:\n3 Third-party SDK: Pangolin advertising SDK Usage: advertising and data analysis in the APP\nInformation collected :1 Allow the program to write to external storage 2. Obtain the rough location\n3. Obtain the exact location\n4. Device identification information (e.g. hardware model, operating system version, device Settings, IME1, MAC address, AndroidiD, list of necessary software, etc.)\nScope of application: TAPTAP, good to swim the channel such as letters, 360 packages such as privacy: https://wwwpangle.cn/privacy4 third-party SDK: advertising SDK application: optimal amount remit to advertise in the APP and data analysis\nInformation collected :1. Allow the program to write to external storage\n2. Get the rough location\n4. Device identification information (such as hardware model, operating system version, device Settings, IME1, MAC address, AndroidiD, list of necessary software, etc.) Applicable scope :TAPTAP, 360, Haoyou Express, etc. https://wwwtencentcom/zh-cn/privacy-policy.html5 Third-party SDK:OPPO app market intermodal SDK(including the current payment aggregation platform of Alipay OPPO secure payment e-link payment) and advertising SDK Usage :1 Intermodal market must be accessed. Information collected from advertising and data analysis in the App :1. Device identification information (e.g. hardware model, operating system version, device Settings, IME1, MAC address, AndroidlD, list of necessary software, etc.)\nAllow programs to write to external storage. 3. Allow programs to read external storage\n4. Get rough locations\n5. Obtain the exact location\nScope of application :OPPO channel package\nPrivacy note: https://privacy.oppo.com/cn/overview/@ third-party SDK: VIVO application market combined transport and advertising SDK (it may be integrated headlines SDK, and quickly advertising SDK)\nUsage :1) The combined transport market must be accessed; 2) advertising and data analysis in the App\nInformation collected:\n1. Device identification information (e.g. hardware model, operating system version, device Settings, IME1, MAC address, AndroidID, list of necessary software, etc.)\n2. Allow programs to write to external storage\n3. Allow programs to write to external storage\n4. Allow applications to read external storage\n4. Get rough locations\n5 Obtain the exact location\nScope of application :VIVO channel package Privacy https://www.vivocom.cn/about-vivo/privacy-policyD third-party SDK: huawei application market combined transport and advertising SDK application: 1 combined transport market must access: 2 in the ADp advertising and data analysis to collect information: 1 device identification information (such as hardware model, fuck System version, device Settings, IME1, MAC address, AndroidID, list of necessary software, etc.)2 Allow the program to write to external storage\n3. Allow programs to read external storage 4. Obtain rough location 5. Obtain exact location Application scope: Huawei channel package Privacy Description :8 Third-party SDK: Xiaomi app market Intermodal and advertising SDK Usage :1 Intermodal market must be accessed. 1. Device identification information (such as hardware model, operating system version, device Settings, IME1, MAC address, AndroidID, list of necessary software, etc.) https://privacy.micom/all/zh_CN/\n1.3 Exceptions and Special Circumstances of Information Collection and Use 1.3.1 Exceptions According to relevant laws, regulations and national standards, we or the third-party platforms we cooperate with may collect and use your relevant personal information without seeking your authorization and consent under the following circumstances:\n1) Those directly related to national security, national defense security and other national interests, and those directly related to major public interests such as public safety, public health and public knowledge; 2) Those directly related to criminal investigation, prosecution, trial and execution of judgment; 3) To protect your or other individuals' life, property, reputation and other major legal rights and interests, but it is difficult to get the consent of the person:\n4) The collected personal information is disclosed to the public by yourself;\n5) Collect personal information from legally publicly disclosed information, such as legal news reports, government information disclosure and other channels. 6) It is necessary to sign and perform the contract according to your requirements;\n7) Necessary to maintain the safe and stable operation of the products or services provided, such as finding and handling faults of the products or services; 8) When it is necessary to carry out statistical or academic research in the public interest and provide the results of academic research or description, the personal information contained in the results is de-identified; 9) other circumstances stipulated by laws and regulations.\n1.32 Under special circumstances, please understand that the functions and services provided by us and the third-party platforms we cooperate with are constantly updated and developed. If a function or service provided by us needs to obtain new rights but is not listed in the above description, we will separately prompt you to choose whether to authorize or not through popup in the APP. Update and explain in the APP privacy policy; If a function or service provided by a third-party platform needs to obtain your new rights, the third-party platform may update and explain in its privacy policy. If you want to know the latest information about the third-party platform obtaining your rights, you can query the latest privacy policy of the third-party platform. 2.1. Cookies or similar technologies are commonly used on the Internet. When you experience, log in to or use our APP, we or the third party platforms we cooperate with may use relevant technologies to send a Cookie or a slaughtername identifier to your device. To collect and store information about your visits and use of this APP, and to analyze your preference for using our APP. To optimize the user experience. We undertake that we will not use cookies for any purpose other than the purpose set forth in this Privacy Policy. 2.2 When using cookies or similar technologies, we will strictly abide by laws and regulations related to mobile Internet application security, and provide effective security measures to protect your personal information. If you want to know in detail how the third-party platforms we cooperate with use cookies or similar technologies, you can refer to the privacy policy of the third-party platforms.\nIi. How to share, transfer and Disclose Your Personal Information We will strictly abide by relevant laws and regulations, keep your personal information confidential, and will not sell your personal information to a third party. We will only use your personal information for the following legal, legitimate, necessary, specific and explicit purposes: Share, transfer and disclose your personal data under the premise of taking security protection measures in line with industry standards. The personal information used for sharing, transfer and disclosure is the information after de-identification, and the sharing third party cannot re-identify the natural person subject of such information.\n3.1 Sharing \n1) Obtain your express consent or authorization in advance; \n2)\nIn accordance with applicable laws and regulations, or on the basis of mandatory requirements of judicial or administrative authorities; 3) Within the scope permitted by laws and regulations, it is necessary to provide:\n4) Provide your information at the lawful request of your guardian; \n5) Provided in accordance with relevant agreements (including service agreements) signed with you or other legal documents;\n6) Your personal information may be shared with affiliated parties based on your corresponding authorization. However, only necessary personal information will be shared, subject to the purposes stated in this Privacy Policy. If the related party wants to change the purpose of processing personal information, it will be appropriate\nWith your express consent.\n3.2 Transfer 1) Obtain your express consent or authorization in advance;\nIt must be provided in accordance with applicable laws and regulations, requirements of legal procedures, mandatory administrative or judicial requirements\n2)\n3)4 In the case of change involving purchase failure, merger, bankruptcy liquidation, reorganization and other changes, if personal information transfer is involved, the new company or organization holding your personal information will be required to continue to fulfill its responsibilities and obligations under this Privacy Policy, such as after the change\nProvided in accordance with relevant agreements (including service agreements) or other legal documents signed with you;\nTo change the purpose of using personal information, we will require them to obtain your express consent in advance.\n3.3 Public Disclosure 1) According to your needs, disclose the personal information you specify in the way you explicitly agree to disclose, 2) In accordance with the requirements of laws and regulations, administrative or judicial authorities, we may publicly disclose your personal information. Upon receipt of the above disclosure request, we will legally require the requesting party to issue relevant legal documents, such as subpoenas or investigation letters, etc. We carefully examine each disclosure request to ensure that it complies with the relevant legal requirements. Where laws and regulations permit, we will encrypt and protect the files containing disclosed information\nHow to Store Your Personal Information 4.1. We store your personal information only for the period necessary for the purposes stated in this Privacy Policy and for the shortest time required by laws and regulations. If we terminate our services or operations, we and the third-party platforms we cooperate with will promptly stop the activities of continuing to collect your personal information, notify you in advance in accordance with relevant laws and regulations, and delete or anonymize your personal information after the termination of the services or operations, unless otherwise stipulated by laws, regulations or regulatory authorities.\n4.2. Personal information collected and generated by our operations within the territory of the People's Republic of China shall be stored within the territory of the People's Republic of China, except under the following circumstances:\n1) Laws and regulations have clear provisions;\n2) Obtain your authorization and consent;\n3) At present, we will not transmit the above information abroad. If we do, we will comply with relevant national regulations or seek your consent\n4) In view of the above circumstances, we will ensure adequate protection of your personal information in accordance with this Privacy Policy and the requirements of national laws and regulations\nHow to protect Your Personal Information 5.1. We will adopt a strict security system as well as industry-accepted security technologies and procedures to ensure that your personal information is not lost, disclosed, damaged or abused. 5.2 Our services shall encrypt and store your personal information by reasonable means such as encryption technology and anonymization, which are at the level required by the industry, and isolate your personal information by isolation technology. We will also adopt strict data access control and multiple identity authentication technology to protect personal information and prevent data from being misused. 5.3. We strengthen employees' security awareness and understanding of the importance of information protection by establishing data security management norms and adopting strict data access control. We only 54 chopped about it is necessary to know the information of staff access to personal information data, and therefore set up 7 | strict access control and monitoring mechanism, we can also require clock to all the character in your personal information to fulfill the corresponding confidentiality obligations. Failure to fulfill these obligations may result in legal liability or suspension of cooperation with us.\n5.5 We will take all reasonably practicable measures to ensure that we do not collect personal information unrelated to our APP services. We will try our best to protect your personal information security. When your personal information is exposed, In case of damage or hand safety benefits, our control law requires me to inform you in a timely manner: the basic situation and possible impact of the safety incident, the disposal measures we have taken or will take, the suggestions that you can independently prevent and reduce risks, and the remedial measures for you, etc. At the same time, we will timely inform you of relevant information by E-mail, letter, telephone, push notification and other means. When it is difficult to inform the subject of information one by one, we will take a reasonable and effective way to release announcements. At the same time, we will also take the initiative to report the external situation of information security in accordance with the requirements of regulatory authorities. 5.7. When you obtain the virtual products related to our APP through payment, you will transact through the third-party payment service provider. At that time, you will inevitably disclose your information, such as contact information, bank account or email address, to the counterparty or potential counterparty. Please properly protect your own information and provide it to others only when necessary. 5.8 If we detect that you are using our APP, services and related information for fraudulent or illegal purposes, we will take corresponding measures, including but not limited to suspending or terminating your use of our APP or services.\nHow to protect Your Personal Information 5.1. We will adopt a strict security system as well as industry-accepted security technologies and procedures to ensure that your personal information is not lost, disclosed, damaged or abused. 5.2 Our services shall encrypt and store your personal information by reasonable means such as encryption technology and anonymization, which are at the level required by the industry, and isolate your personal information by isolation technology. We will also adopt strict data access control and multiple identity authentication technology to protect personal information and prevent data from being misused. 5.3. We strengthen employees' security awareness and understanding of the importance of information protection by establishing data security management norms and adopting strict data access control. 5.4. We only allow personnel who need to know such information to access personal information data, and set up strict access control and monitoring mechanisms for this purpose. At the same time, we require all personnel who may have access to your personal information to fulfill the corresponding confidentiality obligations. Failure to fulfill these obligations may result in legal liability or suspension of cooperation with us\n5.5 We will take all reasonably practicable measures to ensure that we do not collect personal information unrelated to our APP services 5.6 Internet environment is not 100% safe, we will do our best to protect the security of your personal information. When your personal information is leaked, damaged or lost, we will, in accordance with the requirements of laws and regulations, promptly inform you of the situation and possible impact of the security incident, the external measures we have taken or will take, and the suggestions you can independently prevent and reduce the risk. On your complement measure etc. At the same time, we will timely inform you of the relevant information of the event by mail, letter, telephone, push notification and other means. If it is difficult to inform the subject of the information one by one, we will take a reasonable and effective way to release the announcement. At the same time, we will also in accordance with the requirements of the regulatory authorities, take the initiative to report the information security matter \"disposal situation.\n5.7 When you obtain virtual products related to our APP through payment, you will transact through the third-party payment service provider. You will inevitably have to disclose your information to your counterparty or potential counterparty. , such as the final method, bank account or email, etc. Please protect your own information and only provide it to others when necessary. 5.8. If we detect that you use our APP, services and related information for fraudulent or illegal purposes, we will take corresponding measures, including but not limited to suspending or terminating your use of our APP or services.\n6. How to Manage Your Personal Information 6.1. Access, update and delete Personal Information\nWe attach great importance to your right to manage personal information. You may access, update and delete your personal information in the APP or in the third-party services accessed in the APP according to our guidelines in the APP. Before accessing, updating, and deleting\nWhen stating information, we may ask you to verify your identity to ensure information security\n6.2. Log out of the account\nIf you want to cancel your APP account, you can submit the application for account cancellation according to the guidelines in our APP, or contact us through the contact information listed in Article 9 of this Privacy policy. We will inform you in detail\nLogout of the APP account.\n63. Unless otherwise stipulated by laws and regulations, when you update, delete your personal information or apply for account cancellation. We may not immediately update or delete the information from the backup system. However, these are updated or deleted when the backup is updated\nInformation.\n6.1. Access, Update and Delete Personal Information We attach great importance to your right to manage personal information. You may ask, update and delete your personal information in the APP or in the third-party services accessed in the APP according to our instructions in the APP. When accessing, updating and deleting the foregoing information, we may require you to verify your identity to ensure information security. 6.2. Log out of the account\nIf you want to cancel your APP account, you can submit an application for account cancellation according to the guidelines in our APP, or contact us through the contact information listed in Article 9 of this Privacy Policy, and we will tell you how to cancel your APP account in detail. 6.3. Unless otherwise stipulated by laws and regulations, when you update or delete your personal information or apply for account cancellation, we may not immediately update or delete relevant information from the backup system, but we will update or delete such information when the backup is updated\nInformation.\n71 If you are a minor under the age of 18, before using our APP and the relevant regulations, you should ask for advice under the supervision of your parents or other guardians and get involved in privacy.7.2 We protect the personal information of minors according to the provisions of relevant national laws and regulations. Collect, use, store, share, transfer or disclose personal information of minors only when permitted by law, with the express consent of parents or other guardians or necessary for the protection of minors; If we find that personal information about minors has been collected without prior verifiable parental consent, we will seek to remove the information as soon as possible. 7.3. If you are the guardian of a minor and you have any questions about the personal information of the minor under your custody, please contact us through the contact information published in the Privacy Policy of the Company.\n8.1. The terms of this Privacy Policy are binding on the use of our website and the information collected by us. We reserve the right to modify this policy. If there is any major change, we will try our best to make a clear notice on the official website. Privacy Policy Issue Date: October 15, 2022 Privacy Policy Effective Date: October 15, 2025\nNine, How to contact us\nWe do not respect every user's privacy and entertainment to protect the user's personal information, if you have any questions, comments or suggestions on this privacy policy, welcome to contact us at 9:.00-18.00 working time, we will as soon as possible\nRespond.\nCustomer service Email: support@zeeyogo.com\n "]],0,0,[],[],[]]